Note/note.org
#+TAGS:{func(f) var(v) interface(i) tips(t) }
* unity 学习
** 学习框架
*** 基本编程功底 c#
*** Unity3D引擎使用
*** 3D数学场景的运用
** 水平衡量
来源： 极客学院 走进unity3d 工程师世界
*** UI效果呈现
- 可替代性强
初级工程师
*** 逻辑数据管理
场景中逻辑判断，数据间结构。
初级工程师
*** 游戏内容部署
中级工程师内容，技能释放 任务换装等产品内容。
*** 项目架构搭建
高级开发人员 主程

** Scripts
*** Debug输出
**** debug.log()
**** Debug.logWaring()
**** Debug.logError();

*** time
**** Awake()
**** Start()
*** Time.deltaTime
*** [SerializeField]
*** [HideInspector]
*** 查找组件
**** find
**** getcompent 
反射思想 单例模式
*** transform
负责物体在场景中 位置 转动角度 大小
**** right up forward                                                           :var:
坐标相对物体方向控制
- right
- up
- forward
**** TransFormPoint                                                             :func:
自身坐标转换为世界坐标
**** InverseTransfromPoint                                                      :func:
相反 世界坐标转换为自身坐标
**** TransFormDirection                                                         :func:
自身方向向量
**** InverseTransformDirection
相反 同上

* entity framework 使用学习
** 
* IOS Dev StandFord Learning Note
** 3rd 应用MFC
*** 数组和字典 在swift struct
*** swift 重 struct 和类区别
**** 类可以继承 结构体不可以
**** 结构体传递值 类传递引用
*** swift 不会真正的复制，在更改的时候才会复制。实际复制知识一种指针。
*** swift 中使用下划线在传递中表示不在乎当前值。
47.30
*** tuple 类型
*** 递归概念
*** tag 60:47
** 4th swift and foundation 
*** dict
*** array
*** range 使用
