Note/note.html
<?xml version="1.0" encoding="utf-8"?>
<!DOCTYPE html PUBLIC "-//W3C//DTD XHTML 1.0 Strict//EN"
"http://www.w3.org/TR/xhtml1/DTD/xhtml1-strict.dtd">
<html xmlns="http://www.w3.org/1999/xhtml" lang="en" xml:lang="en">
<head>
<title>note</title>
<!-- 2016-03-20 Sun 14:56 -->
<meta  http-equiv="Content-Type" content="text/html;charset=utf-8" />
<meta  name="generator" content="Org-mode" />
<meta  name="author" content="U-ALW15\mut" />
</head>
<body>
<div id="content">
<h1 class="title">note</h1>
<div id="table-of-contents">
<h2>Table of Contents</h2>
<div id="text-table-of-contents">
<ul>
<li><a href="#sec-1">1. unity 学习</a>
<ul>
<li><a href="#sec-1-1">1.1. 学习框架</a>
<ul>
<li><a href="#sec-1-1-1">1.1.1. 基本编程功底 c#</a></li>
<li><a href="#sec-1-1-2">1.1.2. Unity3D引擎使用</a></li>
<li><a href="#sec-1-1-3">1.1.3. 3D数学场景的运用</a></li>
</ul>
</li>
<li><a href="#sec-1-2">1.2. 水平衡量</a>
<ul>
<li><a href="#sec-1-2-1">1.2.1. UI效果呈现</a></li>
<li><a href="#sec-1-2-2">1.2.2. 逻辑数据管理</a></li>
<li><a href="#sec-1-2-3">1.2.3. 游戏内容部署</a></li>
<li><a href="#sec-1-2-4">1.2.4. 项目架构搭建</a></li>
</ul>
</li>
<li><a href="#sec-1-3">1.3. Scripts</a>
<ul>
<li><a href="#sec-1-3-1">1.3.1. Debug输出</a></li>
<li><a href="#sec-1-3-2">1.3.2. time</a></li>
<li><a href="#sec-1-3-3">1.3.3. Time.deltaTime</a></li>
<li><a href="#sec-1-3-4">1.3.4. [SerializeField]</a></li>
<li><a href="#sec-1-3-5">1.3.5. [HideInspector]</a></li>
<li><a href="#sec-1-3-6">1.3.6. 查找组件</a></li>
<li><a href="#sec-1-3-7">1.3.7. transform</a></li>
</ul>
</li>
</ul>
</li>
<li><a href="#sec-2">2. entity framework 使用学习</a>
<ul>
<li><a href="#sec-2-1">2.1. </a></li>
</ul>
</li>
<li><a href="#sec-3">3. IOS Dev StandFord Learning Note</a>
<ul>
<li><a href="#sec-3-1">3.1. 3rd 应用MFC</a>
<ul>
<li><a href="#sec-3-1-1">3.1.1. 数组和字典 在swift struct</a></li>
<li><a href="#sec-3-1-2">3.1.2. swift 重 struct 和类区别</a></li>
<li><a href="#sec-3-1-3">3.1.3. swift 不会真正的复制，在更改的时候才会复制。实际复制知识一种指针。</a></li>
<li><a href="#sec-3-1-4">3.1.4. swift 中使用下划线在传递中表示不在乎当前值。</a></li>
<li><a href="#sec-3-1-5">3.1.5. tuple 类型</a></li>
<li><a href="#sec-3-1-6">3.1.6. 递归概念</a></li>
<li><a href="#sec-3-1-7">3.1.7. tag 60:47</a></li>
</ul>
</li>
<li><a href="#sec-3-2">3.2. 4th swift and foundation</a>
<ul>
<li><a href="#sec-3-2-1">3.2.1. dict</a></li>
<li><a href="#sec-3-2-2">3.2.2. array</a></li>
<li><a href="#sec-3-2-3">3.2.3. range 使用</a></li>
<li><a href="#sec-3-2-4">3.2.4. NSObject</a></li>
<li><a href="#sec-3-2-5">3.2.5. NSNumber</a></li>
<li><a href="#sec-3-2-6">3.2.6. NSDate</a></li>
<li><a href="#sec-3-2-7">3.2.7. NSData</a></li>
<li><a href="#sec-3-2-8">3.2.8. class struct enum</a></li>
<li><a href="#sec-3-2-9">3.2.9. read document</a></li>
</ul>
</li>
</ul>
</li>
<li><a href="#sec-4">4. IOS 开发</a>
<ul>
<li><a href="#sec-4-1">4.1. storyboard 使用</a>
<ul>
<li><a href="#sec-4-1-1">4.1.1. basic using</a></li>
<li><a href="#sec-4-1-2">4.1.2. AUTOLAYOUT and constriaints</a></li>
<li><a href="#sec-4-1-3">4.1.3. Adaptive Laytou</a></li>
<li><a href="#sec-4-1-4">4.1.4. UIAppearnce Tutorial</a></li>
</ul>
</li>
<li><a href="#sec-4-2">4.2. Views and View Controllers</a>
<ul>
<li><a href="#sec-4-2-1">4.2.1. UIScrollView</a></li>
<li><a href="#sec-4-2-2">4.2.2. UITableView</a></li>
<li><a href="#sec-4-2-3">4.2.3. UICollectionView</a></li>
<li><a href="#sec-4-2-4">4.2.4. UIVisualEffectView</a></li>
<li><a href="#sec-4-2-5">4.2.5. UITableView</a></li>
<li><a href="#sec-4-2-6">4.2.6. CALayer</a></li>
<li><a href="#sec-4-2-7">4.2.7. UISplitView</a></li>
<li><a href="#sec-4-2-8">4.2.8. ViewDebugging</a></li>
<li><a href="#sec-4-2-9">4.2.9. UICollectionView Custom layout</a></li>
</ul>
</li>
<li><a href="#sec-4-3">4.3. Graphics Animation APIs</a>
<ul>
<li><a href="#sec-4-3-1">4.3.1. UIKit Dynamics Tutorial: Getting Started</a></li>
<li><a href="#sec-4-3-2">4.3.2. UIKitCore Image Tutorial: Getting Started</a></li>
<li><a href="#sec-4-3-3">4.3.3. UIKitScene Kit Tutorial: Getting Started</a></li>
<li><a href="#sec-4-3-4">4.3.4. UIKitCore Graphics Tutorial Part 1: Getting Started</a></li>
<li><a href="#sec-4-3-5">4.3.5. UIKitCOre Graphics Tutorial Part 2: Gradients and Contexts</a></li>
<li><a href="#sec-4-3-6">4.3.6. UIKitCore Graphics Tutorial Part 3: Patterns and Playgrounds</a></li>
<li><a href="#sec-4-3-7">4.3.7. UIKitUIKit Dynamics and Swift Tutorial: Tossing Views</a></li>
<li><a href="#sec-4-3-8">4.3.8. UIKitiOS Animation Tutorial: Getting Started</a></li>
<li><a href="#sec-4-3-9">4.3.9. UIKitiOS Animation Tutorial: Custom View Controller Presentation Transitions</a></li>
<li><a href="#sec-4-3-10">4.3.10. UIKitAsyncDisplayKit Tutorial: Node Hierarchies</a></li>
</ul>
</li>
<li><a href="#sec-4-4">4.4. Map Location APIs</a></li>
<li><a href="#sec-4-5">4.5. Saving Data</a></li>
<li><a href="#sec-4-6">4.6. Networking</a></li>
<li><a href="#sec-4-7">4.7. WatchKit</a></li>
<li><a href="#sec-4-8">4.8. <span class="done DONE">DONE</span> swift</a></li>
<li><a href="#sec-4-9">4.9. <span class="todo STARTED">STARTED</span> OC</a>
<ul>
<li><a href="#sec-4-9-1">4.9.1. 特性</a></li>
<li><a href="#sec-4-9-2">4.9.2. NSObject</a></li>
</ul>
</li>
<li><a href="#sec-4-10">4.10. UIKit API</a></li>
</ul>
</li>
<li><a href="#sec-5">5. EMACS 笔记</a></li>
<li><a href="#sec-6">6. MinTTy</a></li>
<li><a href="#sec-7">7. Qt</a></li>
<li><a href="#sec-8">8. linux</a>
<ul>
<li><a href="#sec-8-1">8.1. 安装参数</a>
<ul>
<li><a href="#sec-8-1-1">8.1.1. apm acpi</a></li>
<li><a href="#sec-8-1-2">8.1.2. nofb</a></li>
</ul>
</li>
</ul>
</li>
<li><a href="#sec-9">9. linux学习</a>
<ul>
<li><a href="#sec-9-1">9.1. 磁盘结构</a>
<ul>
<li><a href="#sec-9-1-1">9.1.1. MBR分区</a></li>
<li><a href="#sec-9-1-2">9.1.2. GPT分区</a></li>
</ul>
</li>
<li><a href="#sec-9-2">9.2. linux 目录树结构</a></li>
<li><a href="#sec-9-3">9.3. /dev 目录下各装置含义</a></li>
<li><a href="#sec-9-4">9.4. linux 基础命令</a>
<ul>
<li><a href="#sec-9-4-1">9.4.1. local</a></li>
<li><a href="#sec-9-4-2">9.4.2. date</a></li>
<li><a href="#sec-9-4-3">9.4.3. cal</a></li>
<li><a href="#sec-9-4-4">9.4.4. man</a></li>
<li><a href="#sec-9-4-5">9.4.5. info</a></li>
<li><a href="#sec-9-4-6">9.4.6. doc</a></li>
<li><a href="#sec-9-4-7">9.4.7. sync</a></li>
<li><a href="#sec-9-4-8">9.4.8. bc</a></li>
</ul>
</li>
<li><a href="#sec-9-5">9.5. linix 基础变量</a>
<ul>
<li><a href="#sec-9-5-1">9.5.1. LANG=en<sub>US</sub>.urf8</a></li>
<li><a href="#sec-9-5-2">9.5.2. LC<sub>ALL</sub>=en<sub>US</sub>.urf8</a></li>
</ul>
</li>
<li><a href="#sec-9-6">9.6. 基础热键</a></li>
</ul>
</li>
<li><a href="#sec-10">10. WPF 学习</a>
<ul>
<li><a href="#sec-10-1">10.1. Binding</a>
<ul>
<li><a href="#sec-10-1-1">10.1.1. 属性</a></li>
<li><a href="#sec-10-1-2">10.1.2. 组成</a></li>
</ul>
</li>
</ul>
</li>
<li><a href="#sec-11">11. .net handle json file</a>
<ul>
<li><a href="#sec-11-1">11.1. 介绍</a></li>
<li><a href="#sec-11-2">11.2. 使用方式</a>
<ul>
<li><a href="#sec-11-2-1">11.2.1. JsonReader &amp; JsonWriter 读写</a></li>
<li><a href="#sec-11-2-2">11.2.2. JsonObject 读写</a></li>
<li><a href="#sec-11-2-3">11.2.3. JsonSerializer 读写</a></li>
</ul>
</li>
</ul>
</li>
<li><a href="#sec-12">12. idea</a>
<ul>
<li><a href="#sec-12-1">12.1. <span class="done DONE">DONE</span> mac 下截图工具</a></li>
</ul>
</li>
</ul>
</div>
</div>
<div id="outline-container-sec-1" class="outline-2">
<h2 id="sec-1"><span class="section-number-2">1</span> unity 学习</h2>
<div class="outline-text-2" id="text-1">
</div><div id="outline-container-sec-1-1" class="outline-3">
<h3 id="sec-1-1"><span class="section-number-3">1.1</span> 学习框架</h3>
<div class="outline-text-3" id="text-1-1">
</div><div id="outline-container-sec-1-1-1" class="outline-4">
<h4 id="sec-1-1-1"><span class="section-number-4">1.1.1</span> 基本编程功底 c#</h4>
</div>
<div id="outline-container-sec-1-1-2" class="outline-4">
<h4 id="sec-1-1-2"><span class="section-number-4">1.1.2</span> Unity3D引擎使用</h4>
</div>
<div id="outline-container-sec-1-1-3" class="outline-4">
<h4 id="sec-1-1-3"><span class="section-number-4">1.1.3</span> 3D数学场景的运用</h4>
</div>
</div>
<div id="outline-container-sec-1-2" class="outline-3">
<h3 id="sec-1-2"><span class="section-number-3">1.2</span> 水平衡量</h3>
<div class="outline-text-3" id="text-1-2">
<p>
来源： 极客学院 走进unity3d 工程师世界
</p>
</div>
<div id="outline-container-sec-1-2-1" class="outline-4">
<h4 id="sec-1-2-1"><span class="section-number-4">1.2.1</span> UI效果呈现</h4>
<div class="outline-text-4" id="text-1-2-1">
<ul class="org-ul">
<li>可替代性强
</li>
</ul>
<p>
初级工程师
</p>
</div>
</div>
<div id="outline-container-sec-1-2-2" class="outline-4">
<h4 id="sec-1-2-2"><span class="section-number-4">1.2.2</span> 逻辑数据管理</h4>
<div class="outline-text-4" id="text-1-2-2">
<p>
场景中逻辑判断，数据间结构。
初级工程师
</p>
</div>
</div>
<div id="outline-container-sec-1-2-3" class="outline-4">
<h4 id="sec-1-2-3"><span class="section-number-4">1.2.3</span> 游戏内容部署</h4>
<div class="outline-text-4" id="text-1-2-3">
<p>
中级工程师内容，技能释放 任务换装等产品内容。
</p>
</div>
</div>
<div id="outline-container-sec-1-2-4" class="outline-4">
<h4 id="sec-1-2-4"><span class="section-number-4">1.2.4</span> 项目架构搭建</h4>
<div class="outline-text-4" id="text-1-2-4">
<p>
高级开发人员 主程
</p>
</div>
</div>
</div>

<div id="outline-container-sec-1-3" class="outline-3">
<h3 id="sec-1-3"><span class="section-number-3">1.3</span> Scripts</h3>
<div class="outline-text-3" id="text-1-3">
</div><div id="outline-container-sec-1-3-1" class="outline-4">
<h4 id="sec-1-3-1"><span class="section-number-4">1.3.1</span> Debug输出</h4>
<div class="outline-text-4" id="text-1-3-1">
</div><ol class="org-ol"><li><a id="sec-1-3-1-1" name="sec-1-3-1-1"></a>debug.log()<br  /></li>
<li><a id="sec-1-3-1-2" name="sec-1-3-1-2"></a>Debug.logWaring()<br  /></li>
<li><a id="sec-1-3-1-3" name="sec-1-3-1-3"></a>Debug.logError();<br  /></li></ol>
</div>

<div id="outline-container-sec-1-3-2" class="outline-4">
<h4 id="sec-1-3-2"><span class="section-number-4">1.3.2</span> time</h4>
<div class="outline-text-4" id="text-1-3-2">
</div><ol class="org-ol"><li><a id="sec-1-3-2-1" name="sec-1-3-2-1"></a>Awake()<br  /></li>
<li><a id="sec-1-3-2-2" name="sec-1-3-2-2"></a>Start()<br  /></li></ol>
</div>
<div id="outline-container-sec-1-3-3" class="outline-4">
<h4 id="sec-1-3-3"><span class="section-number-4">1.3.3</span> Time.deltaTime</h4>
</div>
<div id="outline-container-sec-1-3-4" class="outline-4">
<h4 id="sec-1-3-4"><span class="section-number-4">1.3.4</span> [SerializeField]</h4>
</div>
<div id="outline-container-sec-1-3-5" class="outline-4">
<h4 id="sec-1-3-5"><span class="section-number-4">1.3.5</span> [HideInspector]</h4>
</div>
<div id="outline-container-sec-1-3-6" class="outline-4">
<h4 id="sec-1-3-6"><span class="section-number-4">1.3.6</span> 查找组件</h4>
<div class="outline-text-4" id="text-1-3-6">
</div><ol class="org-ol"><li><a id="sec-1-3-6-1" name="sec-1-3-6-1"></a>find<br  /></li>
<li><a id="sec-1-3-6-2" name="sec-1-3-6-2"></a>getcompent<br  /><div class="outline-text-5" id="text-1-3-6-2">
<p>
反射思想 单例模式
</p>
</div>
</li></ol>
</div>
<div id="outline-container-sec-1-3-7" class="outline-4">
<h4 id="sec-1-3-7"><span class="section-number-4">1.3.7</span> transform</h4>
<div class="outline-text-4" id="text-1-3-7">
<p>
负责物体在场景中 位置 转动角度 大小
</p>
</div>
<ol class="org-ol"><li><a id="sec-1-3-7-1" name="sec-1-3-7-1"></a>right up forward&#xa0;&#xa0;&#xa0;<span class="tag"><span class="var">var</span></span><br  /><div class="outline-text-5" id="text-1-3-7-1">
<p>
坐标相对物体方向控制
</p>
<ul class="org-ul">
<li>right
</li>
<li>up
</li>
<li>forward
</li>
</ul>
</div>
</li>
<li><a id="sec-1-3-7-2" name="sec-1-3-7-2"></a>TransFormPoint&#xa0;&#xa0;&#xa0;<span class="tag"><span class="func">func</span></span><br  /><div class="outline-text-5" id="text-1-3-7-2">
<p>
自身坐标转换为世界坐标
</p>
</div>
</li>
<li><a id="sec-1-3-7-3" name="sec-1-3-7-3"></a>InverseTransfromPoint&#xa0;&#xa0;&#xa0;<span class="tag"><span class="func">func</span></span><br  /><div class="outline-text-5" id="text-1-3-7-3">
<p>
相反 世界坐标转换为自身坐标
</p>
</div>
</li>
<li><a id="sec-1-3-7-4" name="sec-1-3-7-4"></a>TransFormDirection&#xa0;&#xa0;&#xa0;<span class="tag"><span class="func">func</span></span><br  /><div class="outline-text-5" id="text-1-3-7-4">
<p>
自身方向向量
</p>
</div>
</li>
<li><a id="sec-1-3-7-5" name="sec-1-3-7-5"></a>InverseTransformDirection<br  /><div class="outline-text-5" id="text-1-3-7-5">
<p>
相反 同上
</p>
</div>
</li></ol>
</div>
</div>
</div>

<div id="outline-container-sec-2" class="outline-2">
<h2 id="sec-2"><span class="section-number-2">2</span> entity framework 使用学习</h2>
<div class="outline-text-2" id="text-2">
</div><div id="outline-container-sec-2-1" class="outline-3">
<h3 id="sec-2-1"><span class="section-number-3">2.1</span> </h3>
</div>
</div>
<div id="outline-container-sec-3" class="outline-2">
<h2 id="sec-3"><span class="section-number-2">3</span> IOS Dev StandFord Learning Note</h2>
<div class="outline-text-2" id="text-3">
</div><div id="outline-container-sec-3-1" class="outline-3">
<h3 id="sec-3-1"><span class="section-number-3">3.1</span> 3rd 应用MFC</h3>
<div class="outline-text-3" id="text-3-1">
</div><div id="outline-container-sec-3-1-1" class="outline-4">
<h4 id="sec-3-1-1"><span class="section-number-4">3.1.1</span> 数组和字典 在swift struct</h4>
</div>
<div id="outline-container-sec-3-1-2" class="outline-4">
<h4 id="sec-3-1-2"><span class="section-number-4">3.1.2</span> swift 重 struct 和类区别</h4>
<div class="outline-text-4" id="text-3-1-2">
</div><ol class="org-ol"><li><a id="sec-3-1-2-1" name="sec-3-1-2-1"></a>类可以继承 结构体不可以<br  /></li>
<li><a id="sec-3-1-2-2" name="sec-3-1-2-2"></a>结构体传递值 类传递引用<br  /></li></ol>
</div>
<div id="outline-container-sec-3-1-3" class="outline-4">
<h4 id="sec-3-1-3"><span class="section-number-4">3.1.3</span> swift 不会真正的复制，在更改的时候才会复制。实际复制知识一种指针。</h4>
</div>
<div id="outline-container-sec-3-1-4" class="outline-4">
<h4 id="sec-3-1-4"><span class="section-number-4">3.1.4</span> swift 中使用下划线在传递中表示不在乎当前值。</h4>
<div class="outline-text-4" id="text-3-1-4">
<p>
47.30
</p>
</div>
</div>
<div id="outline-container-sec-3-1-5" class="outline-4">
<h4 id="sec-3-1-5"><span class="section-number-4">3.1.5</span> tuple 类型</h4>
</div>
<div id="outline-container-sec-3-1-6" class="outline-4">
<h4 id="sec-3-1-6"><span class="section-number-4">3.1.6</span> 递归概念</h4>
</div>
<div id="outline-container-sec-3-1-7" class="outline-4">
<h4 id="sec-3-1-7"><span class="section-number-4">3.1.7</span> tag 60:47</h4>
</div>
</div>
<div id="outline-container-sec-3-2" class="outline-3">
<h3 id="sec-3-2"><span class="section-number-3">3.2</span> 4th swift and foundation</h3>
