Note/note.org
*** NSObject
root object advance project in after
*** NSNumber
doubleValue inVlaue
*** NSDate
*** NSData
ubtyped data memory 
***  class struct enum 
**** same
property functions
**** struct and class same place
both have initializer()
**** Diff
***** inheritance(class)
***** introspection and casting(class Only)
***** copy(struct and enum) and reference
***** mutationg 
***** ARC 
***** final cannot override
***** static for signal 
***** internal and external
***** property
***** lazy propert

**** init closure 
use lazy to instantiation 
**** 

**** page 29min37s
**** 
*** read document

* IOS 开发
** storyboard 使用

*** basic using

**** 标准空间使用和个性化
+ UITableViewController
+ UINavigation Controller
+ Button
+ label
+ textField
+ viewController
  
**** 控件交互
@IBAction
@IBAOutlet

**** 界面交互
+ push
+ modal
+ custom
***** uwind 
id
prepareForSegue

**** MVC

appdelegate
dataSource
viewController

*** AUTOLAYOUT and constriaints

*** Adaptive Laytou

*** UIAppearnce Tutorial

** Views and View Controllers
*** UIScrollView
*** UITableView

*** UICollectionView

*** UIVisualEffectView

*** UITableView

*** CALayer

*** UISplitView

*** ViewDebugging

*** UICollectionView Custom layout

** Graphics Animation APIs
***  UIKit Dynamics Tutorial: Getting Started
***  UIKitCore Image Tutorial: Getting Started
***  UIKitScene Kit Tutorial: Getting Started
***  UIKitCore Graphics Tutorial Part 1: Getting Started
***  UIKitCOre Graphics Tutorial Part 2: Gradients and Contexts
***  UIKitCore Graphics Tutorial Part 3: Patterns and Playgrounds
***  UIKitUIKit Dynamics and Swift Tutorial: Tossing Views
***  UIKitiOS Animation Tutorial: Getting Started
***  UIKitiOS Animation Tutorial: Custom View Controller Presentation Transitions
***  UIKitAsyncDisplayKit Tutorial: Node Hierarchies
** Map Location APIs
** Saving Data
** Networking
** WatchKit
** DONE swift
   CLOSED: [2015-09-10 Thu 17:04]
   - State "DONE"       from ""           [2015-09-10 Thu 17:04]

** STARTED OC
   - State "TODO"       from "CANCELLED"  [2015-10-07 Wed 10:04]
   - State "CANCELLED"  from ""           [2015-09-10 Thu 17:04]
.h is a interface file or header file  .m include function code
*** 特性
**** in header file  interface 
只能单继承
@interface  className : fatherClass{}
  NSString *ItemName //实例变量
  }
   //存取实例变量
  -(void)setItemName:(NSString *)str;
  -(NSString *)itemName;
@end

*** NSObject
**** NSString 
@"" 字符串
**** NSLog
控制台输出  参数不定 
**** NSArray
+ objectAtIndex
+ count
***** NSMtableArray
+ addObject:
+ insertObject:AtIndex:
+ removeObject:

** UIKit API
 
* EMACS 笔记
* MinTTy
* Qt    
在qt多平台编译下，pro文件中在同意项目中， 在linux中 需要将全局变量所在cpp和。h SOURCES＋＝ 和HEADER＋＝ 中的顺序应该 放在使用使用变量类之前
在win下正好相反

* linux 

** 安装参数
