Note/note.html
<div class="outline-text-3" id="text-3-2">
</div><div id="outline-container-sec-3-2-1" class="outline-4">
<h4 id="sec-3-2-1"><span class="section-number-4">3.2.1</span> dict</h4>
</div>
<div id="outline-container-sec-3-2-2" class="outline-4">
<h4 id="sec-3-2-2"><span class="section-number-4">3.2.2</span> array</h4>
</div>
<div id="outline-container-sec-3-2-3" class="outline-4">
<h4 id="sec-3-2-3"><span class="section-number-4">3.2.3</span> range 使用</h4>
</div>
<div id="outline-container-sec-3-2-4" class="outline-4">
<h4 id="sec-3-2-4"><span class="section-number-4">3.2.4</span> NSObject</h4>
<div class="outline-text-4" id="text-3-2-4">
<p>
root object advance project in after
</p>
</div>
</div>
<div id="outline-container-sec-3-2-5" class="outline-4">
<h4 id="sec-3-2-5"><span class="section-number-4">3.2.5</span> NSNumber</h4>
<div class="outline-text-4" id="text-3-2-5">
<p>
doubleValue inVlaue
</p>
</div>
</div>
<div id="outline-container-sec-3-2-6" class="outline-4">
<h4 id="sec-3-2-6"><span class="section-number-4">3.2.6</span> NSDate</h4>
</div>
<div id="outline-container-sec-3-2-7" class="outline-4">
<h4 id="sec-3-2-7"><span class="section-number-4">3.2.7</span> NSData</h4>
<div class="outline-text-4" id="text-3-2-7">
<p>
ubtyped data memory 
</p>
</div>
</div>
<div id="outline-container-sec-3-2-8" class="outline-4">
<h4 id="sec-3-2-8"><span class="section-number-4">3.2.8</span> class struct enum</h4>
<div class="outline-text-4" id="text-3-2-8">
</div><ol class="org-ol"><li><a id="sec-3-2-8-1" name="sec-3-2-8-1"></a>same<br  /><div class="outline-text-5" id="text-3-2-8-1">
<p>
property functions
</p>
</div>
</li>
<li><a id="sec-3-2-8-2" name="sec-3-2-8-2"></a>struct and class same place<br  /><div class="outline-text-5" id="text-3-2-8-2">
<p>
both have initializer()
</p>
</div>
</li>
<li><a id="sec-3-2-8-3" name="sec-3-2-8-3"></a>Diff<br  /><ol class="org-ol"><li><a id="sec-3-2-8-3-1" name="sec-3-2-8-3-1"></a>inheritance(class)<br  /></li>
<li><a id="sec-3-2-8-3-2" name="sec-3-2-8-3-2"></a>introspection and casting(class Only)<br  /></li>
<li><a id="sec-3-2-8-3-3" name="sec-3-2-8-3-3"></a>copy(struct and enum) and reference<br  /></li>
<li><a id="sec-3-2-8-3-4" name="sec-3-2-8-3-4"></a>mutationg<br  /></li>
<li><a id="sec-3-2-8-3-5" name="sec-3-2-8-3-5"></a>ARC<br  /></li>
<li><a id="sec-3-2-8-3-6" name="sec-3-2-8-3-6"></a>final cannot override<br  /></li>
<li><a id="sec-3-2-8-3-7" name="sec-3-2-8-3-7"></a>static for signal<br  /></li>
<li><a id="sec-3-2-8-3-8" name="sec-3-2-8-3-8"></a>internal and external<br  /></li>
<li><a id="sec-3-2-8-3-9" name="sec-3-2-8-3-9"></a>property<br  /></li>
<li><a id="sec-3-2-8-3-10" name="sec-3-2-8-3-10"></a>lazy propert<br  /></li></ol>
</li>

<li><a id="sec-3-2-8-4" name="sec-3-2-8-4"></a>init closure<br  /><div class="outline-text-5" id="text-3-2-8-4">
<p>
use lazy to instantiation 
</p>
</div>
</li>
<li><a id="sec-3-2-8-5" name="sec-3-2-8-5"></a><br  /></li>

<li><a id="sec-3-2-8-6" name="sec-3-2-8-6"></a>page 29min37s<br  /></li>
<li><a id="sec-3-2-8-7" name="sec-3-2-8-7"></a><br  /></li></ol>
</div>
<div id="outline-container-sec-3-2-9" class="outline-4">
<h4 id="sec-3-2-9"><span class="section-number-4">3.2.9</span> read document</h4>
</div>
</div>
</div>

<div id="outline-container-sec-4" class="outline-2">
<h2 id="sec-4"><span class="section-number-2">4</span> IOS 开发</h2>
<div class="outline-text-2" id="text-4">
</div><div id="outline-container-sec-4-1" class="outline-3">
<h3 id="sec-4-1"><span class="section-number-3">4.1</span> storyboard 使用</h3>
<div class="outline-text-3" id="text-4-1">
</div><div id="outline-container-sec-4-1-1" class="outline-4">
<h4 id="sec-4-1-1"><span class="section-number-4">4.1.1</span> basic using</h4>
<div class="outline-text-4" id="text-4-1-1">
</div><ol class="org-ol"><li><a id="sec-4-1-1-1" name="sec-4-1-1-1"></a>标准空间使用和个性化<br  /><div class="outline-text-5" id="text-4-1-1-1">
<ul class="org-ul">
<li>UITableViewController
</li>
<li>UINavigation Controller
</li>
<li>Button
</li>
<li>label
</li>
<li>textField
</li>
<li>viewController
</li>
</ul>
</div>
</li>

<li><a id="sec-4-1-1-2" name="sec-4-1-1-2"></a>控件交互<br  /><div class="outline-text-5" id="text-4-1-1-2">
<p>
@IBAction
@IBAOutlet
</p>
</div>
</li>

<li><a id="sec-4-1-1-3" name="sec-4-1-1-3"></a>界面交互<br  /><div class="outline-text-5" id="text-4-1-1-3">
<ul class="org-ul">
<li>push
</li>
<li>modal
</li>
<li>custom
</li>
</ul>
</div>
<ol class="org-ol"><li><a id="sec-4-1-1-3-1" name="sec-4-1-1-3-1"></a>uwind<br  /><div class="outline-text-6" id="text-4-1-1-3-1">
<p>
id
prepareForSegue
</p>
</div>
</li></ol>
</li>

<li><a id="sec-4-1-1-4" name="sec-4-1-1-4"></a>MVC<br  /><div class="outline-text-5" id="text-4-1-1-4">
<p>
appdelegate
dataSource
viewController
</p>
</div>
</li></ol>
</div>

<div id="outline-container-sec-4-1-2" class="outline-4">
<h4 id="sec-4-1-2"><span class="section-number-4">4.1.2</span> AUTOLAYOUT and constriaints</h4>
</div>

<div id="outline-container-sec-4-1-3" class="outline-4">
<h4 id="sec-4-1-3"><span class="section-number-4">4.1.3</span> Adaptive Laytou</h4>
</div>

<div id="outline-container-sec-4-1-4" class="outline-4">
<h4 id="sec-4-1-4"><span class="section-number-4">4.1.4</span> UIAppearnce Tutorial</h4>
</div>
</div>

<div id="outline-container-sec-4-2" class="outline-3">
<h3 id="sec-4-2"><span class="section-number-3">4.2</span> Views and View Controllers</h3>
<div class="outline-text-3" id="text-4-2">
</div><div id="outline-container-sec-4-2-1" class="outline-4">
<h4 id="sec-4-2-1"><span class="section-number-4">4.2.1</span> UIScrollView</h4>
</div>
<div id="outline-container-sec-4-2-2" class="outline-4">
<h4 id="sec-4-2-2"><span class="section-number-4">4.2.2</span> UITableView</h4>
</div>

<div id="outline-container-sec-4-2-3" class="outline-4">
<h4 id="sec-4-2-3"><span class="section-number-4">4.2.3</span> UICollectionView</h4>
</div>

<div id="outline-container-sec-4-2-4" class="outline-4">
<h4 id="sec-4-2-4"><span class="section-number-4">4.2.4</span> UIVisualEffectView</h4>
</div>

<div id="outline-container-sec-4-2-5" class="outline-4">
<h4 id="sec-4-2-5"><span class="section-number-4">4.2.5</span> UITableView</h4>
</div>

<div id="outline-container-sec-4-2-6" class="outline-4">
<h4 id="sec-4-2-6"><span class="section-number-4">4.2.6</span> CALayer</h4>
</div>

<div id="outline-container-sec-4-2-7" class="outline-4">
<h4 id="sec-4-2-7"><span class="section-number-4">4.2.7</span> UISplitView</h4>
</div>

<div id="outline-container-sec-4-2-8" class="outline-4">
<h4 id="sec-4-2-8"><span class="section-number-4">4.2.8</span> ViewDebugging</h4>
</div>

<div id="outline-container-sec-4-2-9" class="outline-4">
<h4 id="sec-4-2-9"><span class="section-number-4">4.2.9</span> UICollectionView Custom layout</h4>
</div>
</div>

<div id="outline-container-sec-4-3" class="outline-3">
<h3 id="sec-4-3"><span class="section-number-3">4.3</span> Graphics Animation APIs</h3>
<div class="outline-text-3" id="text-4-3">
</div><div id="outline-container-sec-4-3-1" class="outline-4">
<h4 id="sec-4-3-1"><span class="section-number-4">4.3.1</span> UIKit Dynamics Tutorial: Getting Started</h4>
</div>
<div id="outline-container-sec-4-3-2" class="outline-4">
<h4 id="sec-4-3-2"><span class="section-number-4">4.3.2</span> UIKitCore Image Tutorial: Getting Started</h4>
</div>
<div id="outline-container-sec-4-3-3" class="outline-4">
<h4 id="sec-4-3-3"><span class="section-number-4">4.3.3</span> UIKitScene Kit Tutorial: Getting Started</h4>
</div>
<div id="outline-container-sec-4-3-4" class="outline-4">
<h4 id="sec-4-3-4"><span class="section-number-4">4.3.4</span> UIKitCore Graphics Tutorial Part 1: Getting Started</h4>
</div>
<div id="outline-container-sec-4-3-5" class="outline-4">
<h4 id="sec-4-3-5"><span class="section-number-4">4.3.5</span> UIKitCOre Graphics Tutorial Part 2: Gradients and Contexts</h4>
</div>
<div id="outline-container-sec-4-3-6" class="outline-4">
<h4 id="sec-4-3-6"><span class="section-number-4">4.3.6</span> UIKitCore Graphics Tutorial Part 3: Patterns and Playgrounds</h4>
</div>
<div id="outline-container-sec-4-3-7" class="outline-4">
<h4 id="sec-4-3-7"><span class="section-number-4">4.3.7</span> UIKitUIKit Dynamics and Swift Tutorial: Tossing Views</h4>
</div>
<div id="outline-container-sec-4-3-8" class="outline-4">
<h4 id="sec-4-3-8"><span class="section-number-4">4.3.8</span> UIKitiOS Animation Tutorial: Getting Started</h4>
</div>
<div id="outline-container-sec-4-3-9" class="outline-4">
<h4 id="sec-4-3-9"><span class="section-number-4">4.3.9</span> UIKitiOS Animation Tutorial: Custom View Controller Presentation Transitions</h4>
</div>
<div id="outline-container-sec-4-3-10" class="outline-4">
<h4 id="sec-4-3-10"><span class="section-number-4">4.3.10</span> UIKitAsyncDisplayKit Tutorial: Node Hierarchies</h4>
</div>
</div>
<div id="outline-container-sec-4-4" class="outline-3">
<h3 id="sec-4-4"><span class="section-number-3">4.4</span> Map Location APIs</h3>
</div>
<div id="outline-container-sec-4-5" class="outline-3">
<h3 id="sec-4-5"><span class="section-number-3">4.5</span> Saving Data</h3>
</div>
<div id="outline-container-sec-4-6" class="outline-3">
<h3 id="sec-4-6"><span class="section-number-3">4.6</span> Networking</h3>
</div>
<div id="outline-container-sec-4-7" class="outline-3">
<h3 id="sec-4-7"><span class="section-number-3">4.7</span> WatchKit</h3>
</div>
<div id="outline-container-sec-4-8" class="outline-3">
<h3 id="sec-4-8"><span class="section-number-3">4.8</span> <span class="done DONE">DONE</span> swift</h3>
<div class="outline-text-3" id="text-4-8">
<ul class="org-ul">
<li>State "DONE"       from ""           <span class="timestamp-wrapper"><span class="timestamp">[2015-09-10 Thu 17:04]</span></span>
</li>
</ul>
</div>
</div>

<div id="outline-container-sec-4-9" class="outline-3">
<h3 id="sec-4-9"><span class="section-number-3">4.9</span> <span class="todo STARTED">STARTED</span> OC</h3>
<div class="outline-text-3" id="text-4-9">
<ul class="org-ul">
<li>State "TODO"       from "CANCELLED"  <span class="timestamp-wrapper"><span class="timestamp">[2015-10-07 Wed 10:04]</span></span>
</li>
<li>State "CANCELLED"  from ""           <span class="timestamp-wrapper"><span class="timestamp">[2015-09-10 Thu 17:04]</span></span>
</li>
</ul>
<p>
.h is a interface file or header file  .m include function code
</p>
</div>
<div id="outline-container-sec-4-9-1" class="outline-4">
<h4 id="sec-4-9-1"><span class="section-number-4">4.9.1</span> 特性</h4>
<div class="outline-text-4" id="text-4-9-1">
</div><ol class="org-ol"><li><a id="sec-4-9-1-1" name="sec-4-9-1-1"></a>in header file  interface<br  /><div class="outline-text-5" id="text-4-9-1-1">
<p>
只能单继承
@interface  className : fatherClass{}
  NSString *ItemName //实例变量
  }
   //存取实例变量
  -(void)setItemName:(NSString *)str;
  -(NSString *)itemName;
@end
</p>
</div>
</li></ol>
</div>

<div id="outline-container-sec-4-9-2" class="outline-4">
<h4 id="sec-4-9-2"><span class="section-number-4">4.9.2</span> NSObject</h4>
<div class="outline-text-4" id="text-4-9-2">
</div><ol class="org-ol"><li><a id="sec-4-9-2-1" name="sec-4-9-2-1"></a>NSString<br  /><div class="outline-text-5" id="text-4-9-2-1">
<p>
@"" 字符串
</p>
</div>
</li>
<li><a id="sec-4-9-2-2" name="sec-4-9-2-2"></a>NSLog<br  /><div class="outline-text-5" id="text-4-9-2-2">
<p>
控制台输出  参数不定 
</p>
</div>
</li>
<li><a id="sec-4-9-2-3" name="sec-4-9-2-3"></a>NSArray<br  /><div class="outline-text-5" id="text-4-9-2-3">
<ul class="org-ul">
<li>objectAtIndex
</li>
<li>count
</li>
</ul>
</div>
<ol class="org-ol"><li><a id="sec-4-9-2-3-1" name="sec-4-9-2-3-1"></a>NSMtableArray<br  /><div class="outline-text-6" id="text-4-9-2-3-1">
<ul class="org-ul">
<li>addObject:
</li>
<li>insertObject:AtIndex:
</li>
<li>removeObject:
</li>
</ul>
</div>
</li></ol>
</li></ol>
</div>
</div>

<div id="outline-container-sec-4-10" class="outline-3">
<h3 id="sec-4-10"><span class="section-number-3">4.10</span> UIKit API</h3>
</div>
</div>

<div id="outline-container-sec-5" class="outline-2">
<h2 id="sec-5"><span class="section-number-2">5</span> EMACS 笔记</h2>
</div>
<div id="outline-container-sec-6" class="outline-2">
<h2 id="sec-6"><span class="section-number-2">6</span> MinTTy</h2>
</div>
<div id="outline-container-sec-7" class="outline-2">
<h2 id="sec-7"><span class="section-number-2">7</span> Qt</h2>
<div class="outline-text-2" id="text-7">
<p>
在qt多平台编译下，pro文件中在同意项目中， 在linux中 需要将全局变量所在cpp和。h SOURCES＋＝ 和HEADER＋＝ 中的顺序应该 放在使用使用变量类之前
在win下正好相反
</p>
</div>
</div>
