Note/note.org
*** apm acpi
apm(Advanced Power Management)是早期的電源管理模組，acpi(Advanced Configuration and Power Interface)則是近期的電源管理模組。這兩者都是硬體本身就有支援的，但是筆記型電腦可能不是使用這些機制， 因此，當安裝時啟動這些機制將會造成一些錯誤，導致無法順利安裝。
*** nofb
nofb則是取消顯示卡上面的緩衝記憶體偵測。因為筆記型電腦的顯示卡常常是整合型的， Linux安裝程式本身可能就不是很能夠偵測到該顯示卡模組。此時加入nofb將可能使得你的安裝過程順利一些 

* linux学习
** 磁盘结构
*** MBR分区
*** GPT分区
** linux 目录树结构
** /dev 目录下各装置含义
  | 裝置                | 裝置在Linux內的檔名                |
  |---------------------+------------------------------------|
  | SCSI/SATA/USB硬碟機 | /dev/sd[a-p]                       |
  | USB快閃碟           | /dev/sd[a-p] (與SATA相同)          |
  |---------------------+------------------------------------|
  | VirtI/O界面         | /dev/vd[a-p] (用於虛擬機器內)      |
  |---------------------+------------------------------------|
  | 軟碟機              | /dev/fd[0-7]                       |
  |---------------------+------------------------------------|
  | 印表機              | /dev/lp[0-2] (25針印表機)          |
  |                     | /dev/usb/lp[0-15] (USB 介面)       |
  |---------------------+------------------------------------|
  | 滑鼠                | /dev/input/mouse[0-15] (通用)      |
  |                     | /dev/psaux (PS/2界面)              |
  |                     | /dev/mouse (當前滑鼠)              |
  |---------------------+------------------------------------|
  | CDROM/DVDROM        | /dev/scd[0-1] (通用)               |
  |                     | /dev/sr[0-1] (通用，CentOS 較常見) |
  |                     | /dev/cdrom (當前 CDROM)            |
  |---------------------+------------------------------------|
  | 磁帶機              | /dev/ht0 (IDE 界面)                |
  |                     | /dev/st0 (SATA/SCSI界面)           |
  |                     | /dev/tape (當前磁帶)               |
  |---------------------+------------------------------------|
  | IDE硬碟機           | /dev/hd[a-d] (舊式系統才有)        |
  |---------------------+------------------------------------|
** linux 基础命令
*** local
使用语言
*** date
时间
date +%Y/%m/%d
date +%H:%M
*** cal 
计算
*** man 
作用：manual 操作说明
manual 存放位置：/usr/share/man

| 信号 | 内容                                           |
|------+------------------------------------------------|
|    1 | 使用者在shell环境中可以操作的指令或可执行档    |
|    2 | 系统核心函数和工具                             |
|    3 | 当用函数和函数库 （libc）                      |
|    4 | 装置档案说明                                   |
|    5 | 设定档或默写档案格式                           |
|    6 | 游戏                                           |
|    7 | 惯例与协定 linux档案系统 网络协定 ASCII code等 |
|    8 | 管理员可用管理指令                             |
|    9 | kernel 相关文件                                | 

*** info 
以目录结构保存程序使用说明。
存放位置在 /usr/share/info/
*** doc
软件文档
存放位置在/usr/share/doc/
*** sync 


*** bc
** linix 基础变量
*** LANG=en_US.urf8
*** LC_ALL=en_US.urf8
** 基础热键
| 按键 | 含义                      |
|------+---------------------------|
| C-d  | EOF                       |
| C-c  | init 发送中断当前程序信号 |
| C-z  | 当前程序切入后台运行      |
| Tab  | 自动补全                  |
  

* WPF 学习
** Binding
*** 属性
**** UpdateSourceTrigeer 
类型为 UdateSourceTrigger 
取值为
 - PropertyChanged
 - LostFocus
 - Explicit
 - Default
*** 组成


* .net handle json file
** 介绍
 开源类库newtonsoft.json.下载地址为：http://json.codeplex.com/
已经在github上star 该项目。
** 使用方式
*** JsonReader & JsonWriter 读写
**** JsonReader 
#+BEGIN_SRC C++
  string jsonText = 
    @"{""input"" : ""value"", 
     ""output"" :  ""result""}";
  JsonReader reader = 
     new JsonTextReader(
             new StringReader(jsonText));

  while (reader.Read())
  {
    Console.WriteLine(
       reader.TokenType + "\t\t" + 
       reader.ValueType + "\t\t" +
       reader.Value);
  }
#+END_SRC
result is :
PropertyName System.String input
String       System.String value

**** JsonWriter 
#+BEGIN_SRC C++
  StringWriter sw = new StringWriter();
  JsonWriter writer = new JsonTextWriter(sw);

  writer.WriteStartObject();
  writer.WritePropertyName("input");
  writer.WriteValue("value");
  writer.WritePropertyName("output");
  writer.WriteValue("result");
  writer.WriteEndObject();
  writer.Flush();

  string jsonText = 
   sw.GetStringBuilder().ToString();
  Console.WriteLine(jsonText);
#+END_SRC
