Note/note.html

<div id="outline-container-sec-8" class="outline-2">
<h2 id="sec-8"><span class="section-number-2">8</span> linux</h2>
<div class="outline-text-2" id="text-8">
</div><div id="outline-container-sec-8-1" class="outline-3">
<h3 id="sec-8-1"><span class="section-number-3">8.1</span> 安装参数</h3>
<div class="outline-text-3" id="text-8-1">
</div><div id="outline-container-sec-8-1-1" class="outline-4">
<h4 id="sec-8-1-1"><span class="section-number-4">8.1.1</span> apm acpi</h4>
<div class="outline-text-4" id="text-8-1-1">
<p>
apm(Advanced Power Management)是早期的電源管理模組，acpi(Advanced Configuration and Power Interface)則是近期的電源管理模組。這兩者都是硬體本身就有支援的，但是筆記型電腦可能不是使用這些機制， 因此，當安裝時啟動這些機制將會造成一些錯誤，導致無法順利安裝。
</p>
</div>
</div>
<div id="outline-container-sec-8-1-2" class="outline-4">
<h4 id="sec-8-1-2"><span class="section-number-4">8.1.2</span> nofb</h4>
<div class="outline-text-4" id="text-8-1-2">
<p>
nofb則是取消顯示卡上面的緩衝記憶體偵測。因為筆記型電腦的顯示卡常常是整合型的， Linux安裝程式本身可能就不是很能夠偵測到該顯示卡模組。此時加入nofb將可能使得你的安裝過程順利一些 
</p>
</div>
</div>
</div>
</div>

<div id="outline-container-sec-9" class="outline-2">
<h2 id="sec-9"><span class="section-number-2">9</span> linux学习</h2>
<div class="outline-text-2" id="text-9">
</div><div id="outline-container-sec-9-1" class="outline-3">
<h3 id="sec-9-1"><span class="section-number-3">9.1</span> 磁盘结构</h3>
<div class="outline-text-3" id="text-9-1">
</div><div id="outline-container-sec-9-1-1" class="outline-4">
<h4 id="sec-9-1-1"><span class="section-number-4">9.1.1</span> MBR分区</h4>
</div>
<div id="outline-container-sec-9-1-2" class="outline-4">
<h4 id="sec-9-1-2"><span class="section-number-4">9.1.2</span> GPT分区</h4>
</div>
</div>
<div id="outline-container-sec-9-2" class="outline-3">
<h3 id="sec-9-2"><span class="section-number-3">9.2</span> linux 目录树结构</h3>
</div>
<div id="outline-container-sec-9-3" class="outline-3">
<h3 id="sec-9-3"><span class="section-number-3">9.3</span> /dev 目录下各装置含义</h3>
<div class="outline-text-3" id="text-9-3">
<table border="2" cellspacing="0" cellpadding="6" rules="groups" frame="hsides">


<colgroup>
<col  class="left" />

<col  class="left" />
</colgroup>
<thead>
<tr>
<th scope="col" class="left">裝置</th>
<th scope="col" class="left">裝置在Linux內的檔名</th>
</tr>
</thead>
<tbody>
<tr>
<td class="left">SCSI/SATA/USB硬碟機</td>
<td class="left">/dev/sd[a-p]</td>
</tr>

<tr>
<td class="left">USB快閃碟</td>
<td class="left">/dev/sd[a-p] (與SATA相同)</td>
</tr>
</tbody>
<tbody>
<tr>
<td class="left">VirtI/O界面</td>
<td class="left">/dev/vd[a-p] (用於虛擬機器內)</td>
</tr>
</tbody>
<tbody>
<tr>
<td class="left">軟碟機</td>
<td class="left">/dev/fd[0-7]</td>
</tr>
</tbody>
<tbody>
<tr>
<td class="left">印表機</td>
<td class="left">/dev/lp[0-2] (25針印表機)</td>
</tr>

<tr>
<td class="left">&#xa0;</td>
<td class="left">/dev/usb/lp[0-15] (USB 介面)</td>
</tr>
</tbody>
<tbody>
<tr>
<td class="left">滑鼠</td>
<td class="left">/dev/input/mouse[0-15] (通用)</td>
</tr>

<tr>
<td class="left">&#xa0;</td>
<td class="left">/dev/psaux (PS/2界面)</td>
</tr>

<tr>
<td class="left">&#xa0;</td>
<td class="left">/dev/mouse (當前滑鼠)</td>
</tr>
</tbody>
<tbody>
<tr>
<td class="left">CDROM/DVDROM</td>
<td class="left">/dev/scd[0-1] (通用)</td>
</tr>

<tr>
<td class="left">&#xa0;</td>
<td class="left">/dev/sr[0-1] (通用，CentOS 較常見)</td>
</tr>

<tr>
<td class="left">&#xa0;</td>
<td class="left">/dev/cdrom (當前 CDROM)</td>
</tr>
</tbody>
<tbody>
<tr>
<td class="left">磁帶機</td>
<td class="left">/dev/ht0 (IDE 界面)</td>
</tr>

<tr>
<td class="left">&#xa0;</td>
<td class="left">/dev/st0 (SATA/SCSI界面)</td>
</tr>

<tr>
<td class="left">&#xa0;</td>
<td class="left">/dev/tape (當前磁帶)</td>
</tr>
</tbody>
<tbody>
<tr>
<td class="left">IDE硬碟機</td>
<td class="left">/dev/hd[a-d] (舊式系統才有)</td>
</tr>
</tbody>
</table>
</div>
</div>
<div id="outline-container-sec-9-4" class="outline-3">
<h3 id="sec-9-4"><span class="section-number-3">9.4</span> linux 基础命令</h3>
<div class="outline-text-3" id="text-9-4">
</div><div id="outline-container-sec-9-4-1" class="outline-4">
<h4 id="sec-9-4-1"><span class="section-number-4">9.4.1</span> local</h4>
<div class="outline-text-4" id="text-9-4-1">
<p>
使用语言
</p>
</div>
</div>
<div id="outline-container-sec-9-4-2" class="outline-4">
<h4 id="sec-9-4-2"><span class="section-number-4">9.4.2</span> date</h4>
<div class="outline-text-4" id="text-9-4-2">
<p>
时间
date +%Y/%m/%d
date +%H:%M
</p>
</div>
</div>
<div id="outline-container-sec-9-4-3" class="outline-4">
<h4 id="sec-9-4-3"><span class="section-number-4">9.4.3</span> cal</h4>
<div class="outline-text-4" id="text-9-4-3">
<p>
计算
</p>
</div>
</div>
<div id="outline-container-sec-9-4-4" class="outline-4">
<h4 id="sec-9-4-4"><span class="section-number-4">9.4.4</span> man</h4>
<div class="outline-text-4" id="text-9-4-4">
<p>
作用：manual 操作说明
manual 存放位置：/usr/share/man
</p>

<table border="2" cellspacing="0" cellpadding="6" rules="groups" frame="hsides">


<colgroup>
<col  class="right" />

<col  class="left" />
</colgroup>
<thead>
<tr>
<th scope="col" class="right">信号</th>
<th scope="col" class="left">内容</th>
</tr>
</thead>
<tbody>
<tr>
<td class="right">1</td>
<td class="left">使用者在shell环境中可以操作的指令或可执行档</td>
</tr>

<tr>
<td class="right">2</td>
<td class="left">系统核心函数和工具</td>
</tr>

<tr>
<td class="right">3</td>
<td class="left">当用函数和函数库 （libc）</td>
</tr>

<tr>
<td class="right">4</td>
<td class="left">装置档案说明</td>
</tr>

<tr>
<td class="right">5</td>
<td class="left">设定档或默写档案格式</td>
</tr>

<tr>
<td class="right">6</td>
<td class="left">游戏</td>
</tr>

<tr>
<td class="right">7</td>
<td class="left">惯例与协定 linux档案系统 网络协定 ASCII code等</td>
</tr>

<tr>
<td class="right">8</td>
<td class="left">管理员可用管理指令</td>
</tr>

<tr>
<td class="right">9</td>
<td class="left">kernel 相关文件</td>
</tr>
</tbody>
</table>
</div>
</div>

<div id="outline-container-sec-9-4-5" class="outline-4">
<h4 id="sec-9-4-5"><span class="section-number-4">9.4.5</span> info</h4>
<div class="outline-text-4" id="text-9-4-5">
<p>
以目录结构保存程序使用说明。
存放位置在 <i>usr/share/info</i>
</p>
</div>
</div>
<div id="outline-container-sec-9-4-6" class="outline-4">
<h4 id="sec-9-4-6"><span class="section-number-4">9.4.6</span> doc</h4>
<div class="outline-text-4" id="text-9-4-6">
<p>
软件文档
存放位置在/usr/share/doc/
</p>
</div>
</div>
<div id="outline-container-sec-9-4-7" class="outline-4">
<h4 id="sec-9-4-7"><span class="section-number-4">9.4.7</span> sync</h4>
</div>


<div id="outline-container-sec-9-4-8" class="outline-4">
<h4 id="sec-9-4-8"><span class="section-number-4">9.4.8</span> bc</h4>
</div>
</div>
<div id="outline-container-sec-9-5" class="outline-3">
<h3 id="sec-9-5"><span class="section-number-3">9.5</span> linix 基础变量</h3>
<div class="outline-text-3" id="text-9-5">
</div><div id="outline-container-sec-9-5-1" class="outline-4">
<h4 id="sec-9-5-1"><span class="section-number-4">9.5.1</span> LANG=en<sub>US</sub>.urf8</h4>
</div>
<div id="outline-container-sec-9-5-2" class="outline-4">
<h4 id="sec-9-5-2"><span class="section-number-4">9.5.2</span> LC<sub>ALL</sub>=en<sub>US</sub>.urf8</h4>
</div>
</div>
<div id="outline-container-sec-9-6" class="outline-3">
<h3 id="sec-9-6"><span class="section-number-3">9.6</span> 基础热键</h3>
<div class="outline-text-3" id="text-9-6">
<table border="2" cellspacing="0" cellpadding="6" rules="groups" frame="hsides">


<colgroup>
<col  class="left" />

<col  class="left" />
</colgroup>
<thead>
<tr>
<th scope="col" class="left">按键</th>
<th scope="col" class="left">含义</th>
</tr>
</thead>
<tbody>
<tr>
<td class="left">C-d</td>
<td class="left">EOF</td>
</tr>

<tr>
<td class="left">C-c</td>
<td class="left">init 发送中断当前程序信号</td>
</tr>

<tr>
<td class="left">C-z</td>
<td class="left">当前程序切入后台运行</td>
</tr>

<tr>
<td class="left">Tab</td>
<td class="left">自动补全</td>
</tr>
</tbody>
</table>
</div>
</div>
</div>


<div id="outline-container-sec-10" class="outline-2">
<h2 id="sec-10"><span class="section-number-2">10</span> WPF 学习</h2>
<div class="outline-text-2" id="text-10">
</div><div id="outline-container-sec-10-1" class="outline-3">
<h3 id="sec-10-1"><span class="section-number-3">10.1</span> Binding</h3>
<div class="outline-text-3" id="text-10-1">
</div><div id="outline-container-sec-10-1-1" class="outline-4">
<h4 id="sec-10-1-1"><span class="section-number-4">10.1.1</span> 属性</h4>
<div class="outline-text-4" id="text-10-1-1">
</div><ol class="org-ol"><li><a id="sec-10-1-1-1" name="sec-10-1-1-1"></a>UpdateSourceTrigeer<br  /><div class="outline-text-5" id="text-10-1-1-1">
<p>
类型为 UdateSourceTrigger 
取值为
</p>
<ul class="org-ul">
<li>PropertyChanged
</li>
<li>LostFocus
</li>
<li>Explicit
</li>
<li>Default
</li>
</ul>
</div>
</li></ol>
</div>
<div id="outline-container-sec-10-1-2" class="outline-4">
<h4 id="sec-10-1-2"><span class="section-number-4">10.1.2</span> 组成</h4>
</div>
</div>
</div>


<div id="outline-container-sec-11" class="outline-2">
<h2 id="sec-11"><span class="section-number-2">11</span> .net handle json file</h2>
<div class="outline-text-2" id="text-11">
</div><div id="outline-container-sec-11-1" class="outline-3">
<h3 id="sec-11-1"><span class="section-number-3">11.1</span> 介绍</h3>
<div class="outline-text-3" id="text-11-1">
<p>
开源类库newtonsoft.json.下载地址为：<a href="http://json.codeplex.com/">http://json.codeplex.com/</a>
已经在github上star 该项目。
</p>
</div>
</div>
<div id="outline-container-sec-11-2" class="outline-3">
<h3 id="sec-11-2"><span class="section-number-3">11.2</span> 使用方式</h3>
<div class="outline-text-3" id="text-11-2">
</div><div id="outline-container-sec-11-2-1" class="outline-4">
<h4 id="sec-11-2-1"><span class="section-number-4">11.2.1</span> JsonReader &amp; JsonWriter 读写</h4>
<div class="outline-text-4" id="text-11-2-1">
</div><ol class="org-ol"><li><a id="sec-11-2-1-1" name="sec-11-2-1-1"></a>JsonReader<br  /><div class="outline-text-5" id="text-11-2-1-1">
<div class="org-src-container">

<pre class="src src-C++"><span style="color: #66D9EF;">string</span> <span style="color: #F92672;">jsonText</span> = 
  @<span style="color: #E6DB74;">"{""input"" : ""value"", </span>
<span style="color: #E6DB74;">   ""output"" :  ""result""}"</span>;
<span style="color: #66D9EF;">JsonReader</span> <span style="color: #F92672;">reader</span> = 
   <span style="color: #66D9EF;">new</span> <span style="color: #66D9EF;">JsonTextReader</span>(
           <span style="color: #66D9EF;">new</span> <span style="color: #66D9EF;">StringReader</span>(jsonText));

<span style="color: #66D9EF;">while</span> (reader.Read())
{
  Console.WriteLine(
     reader.TokenType + <span style="color: #E6DB74;">"\t\t"</span> + 
     reader.ValueType + <span style="color: #E6DB74;">"\t\t"</span> +
     reader.Value);
}
</pre>
</div>
<p>
result is :
PropertyName System.String input
String       System.String value
</p>
</div>
</li>

<li><a id="sec-11-2-1-2" name="sec-11-2-1-2"></a>JsonWriter<br  /><div class="outline-text-5" id="text-11-2-1-2">
<div class="org-src-container">

<pre class="src src-C++"><span style="color: #66D9EF;">StringWriter</span> <span style="color: #F92672;">sw</span> = <span style="color: #66D9EF;">new</span> <span style="color: #66D9EF;">StringWriter</span>();
<span style="color: #66D9EF;">JsonWriter</span> <span style="color: #F92672;">writer</span> = <span style="color: #66D9EF;">new</span> <span style="color: #66D9EF;">JsonTextWriter</span>(sw);

writer.WriteStartObject();
writer.WritePropertyName(<span style="color: #E6DB74;">"input"</span>);
writer.WriteValue(<span style="color: #E6DB74;">"value"</span>);
writer.WritePropertyName(<span style="color: #E6DB74;">"output"</span>);
writer.WriteValue(<span style="color: #E6DB74;">"result"</span>);
writer.WriteEndObject();
writer.Flush();

<span style="color: #66D9EF;">string</span> <span style="color: #F92672;">jsonText</span> = 
 sw.GetStringBuilder().ToString();
Console.WriteLine(jsonText);
</pre>
</div>
</div>
</li></ol>
</div>
