Note/note.org
*** JsonObject 读写
#+BEGIN_SRC C++
  JObject jo = JObject.Parse(jsonText);
  string[] values = 
        jo.Properties().Select(
            item=>     
             item.Value.ToString()
         ).ToArray();
#+END_SRC
*** JsonSerializer 读写
**** 数组型
#+BEGIN_SRC C++
string jsonArrayText1 = "[{'a':'a1','b':'b1'},{'a':'a2','b':'b2'}]";
JArray ja = (JArray)JsonConvert.DeserializeObject(jsonArrayText1);
string ja1a = ja[1]["a"].ToString();
//或者
JObject o = (JObject)ja[1];
string oa = o["a"].ToString();
#+END_SRC
**** 嵌套格式
#+BEGIN_SRC C++
string jsonText = "{\"beijing\":{\"zone\":\"海淀\",\"zone_en\":\"haidian\"}}";
JObject jo = (JObject)JsonConvert.DeserializeObject(jsonText);
string zone = jo["beijing"]["zone"].ToString();
string zone_en = jo["beijing"]["zone_en"].ToString();string jsonText = "{\"beijing\":{\"zone\":\"海淀\",\"zone_en\":\"haidian\"}}";
JObject jo = (JObject)JsonConvert.DeserializeObject(jsonText);
string zone = jo["beijing"]["zone"].ToString();
string zone_en = jo["beijing"]["zone_en"].ToString();"}"
#+END_SRC
**** 自定义类Project
#+BEGIN_SRC C++

Project p = new Project() { Input = "stone", Output = "gold" };
JsonSerializer serializer = new JsonSerializer();
StringWriter sw = new StringWriter();
serializer.Serialize(new JsonTextWriter(sw), p);
Console.WriteLine(sw.GetStringBuilder().ToString());

StringReader sr = new StringReader(@"{""Input"":""stone"", ""Output"":""gold""}");
Project p1 = (Project)serializer.Deserialize(new JsonTextReader(sr), typeof(Project));
Console.WriteLine(p1.Input + "=>" + p1.Output);"}")
#+END_SRC

* idea 
** DONE mac 下截图工具 
   CLOSED: [2015-08-27 Thu 17:01]
   - State "DONE"       from ""           [2015-08-27 Thu 17:01]
qq 不错 先用着


