Note/note.html
<div id="outline-container-sec-11-2-2" class="outline-4">
<h4 id="sec-11-2-2"><span class="section-number-4">11.2.2</span> JsonObject 读写</h4>
<div class="outline-text-4" id="text-11-2-2">
<div class="org-src-container">

<pre class="src src-C++"><span style="color: #66D9EF;">JObject</span> <span style="color: #F92672;">jo</span> = JObject.Parse(jsonText);
<span style="color: #66D9EF;">string</span>[] values = 
      jo.Properties().Select(
          item=&gt;     
           item.Value.ToString()
       ).ToArray();
</pre>
</div>
</div>
</div>
<div id="outline-container-sec-11-2-3" class="outline-4">
<h4 id="sec-11-2-3"><span class="section-number-4">11.2.3</span> JsonSerializer 读写</h4>
<div class="outline-text-4" id="text-11-2-3">
</div><ol class="org-ol"><li><a id="sec-11-2-3-1" name="sec-11-2-3-1"></a>数组型<br  /><div class="outline-text-5" id="text-11-2-3-1">
<div class="org-src-container">

<pre class="src src-C++"><span style="color: #66D9EF;">string</span> <span style="color: #F92672;">jsonArrayText1</span> = <span style="color: #E6DB74;">"[{'a':'a1','b':'b1'},{'a':'a2','b':'b2'}]"</span>;
<span style="color: #66D9EF;">JArray</span> <span style="color: #F92672;">ja</span> = (<span style="color: #66D9EF;">JArray</span>)JsonConvert.DeserializeObject(jsonArrayText1);
<span style="color: #66D9EF;">string</span> <span style="color: #F92672;">ja1a</span> = ja[1][<span style="color: #E6DB74;">"a"</span>].ToString();
<span style="color: #465457; font-style: italic;">//</span><span style="color: #465457; font-style: italic;">&#25110;&#32773;</span>
<span style="color: #66D9EF;">JObject</span> <span style="color: #F92672;">o</span> = (<span style="color: #66D9EF;">JObject</span>)ja[1];
<span style="color: #66D9EF;">string</span> <span style="color: #F92672;">oa</span> = o[<span style="color: #E6DB74;">"a"</span>].ToString();
</pre>
</div>
</div>
</li>
<li><a id="sec-11-2-3-2" name="sec-11-2-3-2"></a>嵌套格式<br  /><div class="outline-text-5" id="text-11-2-3-2">
<div class="org-src-container">

<pre class="src src-C++"><span style="color: #66D9EF;">string</span> <span style="color: #F92672;">jsonText</span> = <span style="color: #E6DB74;">"{\"beijing\":{\"zone\":\"&#28023;&#28096;\",\"zone_en\":\"haidian\"}}"</span>;
<span style="color: #66D9EF;">JObject</span> <span style="color: #F92672;">jo</span> = (<span style="color: #66D9EF;">JObject</span>)JsonConvert.DeserializeObject(jsonText);
<span style="color: #66D9EF;">string</span> <span style="color: #F92672;">zone</span> = jo[<span style="color: #E6DB74;">"beijing"</span>][<span style="color: #E6DB74;">"zone"</span>].ToString();
<span style="color: #66D9EF;">string</span> <span style="color: #F92672;">zone_en</span> = jo[<span style="color: #E6DB74;">"beijing"</span>][<span style="color: #E6DB74;">"zone_en"</span>].ToString();<span style="color: #66D9EF;">string</span> <span style="color: #F92672;">jsonText</span> = <span style="color: #E6DB74;">"{\"beijing\":{\"zone\":\"&#28023;&#28096;\",\"zone_en\":\"haidian\"}}"</span>;
<span style="color: #66D9EF;">JObject</span> <span style="color: #F92672;">jo</span> = (<span style="color: #66D9EF;">JObject</span>)JsonConvert.DeserializeObject(jsonText);
<span style="color: #66D9EF;">string</span> <span style="color: #F92672;">zone</span> = jo[<span style="color: #E6DB74;">"beijing"</span>][<span style="color: #E6DB74;">"zone"</span>].ToString();
<span style="color: #66D9EF;">string</span> <span style="color: #F92672;">zone_en</span> = jo[<span style="color: #E6DB74;">"beijing"</span>][<span style="color: #E6DB74;">"zone_en"</span>].ToString();<span style="color: #E6DB74;">"}"</span>
</pre>
</div>
</div>
</li>
<li><a id="sec-11-2-3-3" name="sec-11-2-3-3"></a>自定义类Project<br  /><div class="outline-text-5" id="text-11-2-3-3">
<div class="org-src-container">

<pre class="src src-C++"><span style="color: #66D9EF;">Project</span> <span style="color: #F92672;">p</span> = <span style="color: #66D9EF;">new</span> <span style="color: #66D9EF;">Project</span>() { Input = <span style="color: #E6DB74;">"stone"</span>, Output = <span style="color: #E6DB74;">"gold"</span> };
<span style="color: #66D9EF;">JsonSerializer</span> <span style="color: #F92672;">serializer</span> = <span style="color: #66D9EF;">new</span> <span style="color: #66D9EF;">JsonSerializer</span>();
<span style="color: #66D9EF;">StringWriter</span> <span style="color: #F92672;">sw</span> = <span style="color: #66D9EF;">new</span> <span style="color: #66D9EF;">StringWriter</span>();
serializer.Serialize(<span style="color: #66D9EF;">new</span> <span style="color: #66D9EF;">JsonTextWriter</span>(sw), p);
Console.WriteLine(sw.GetStringBuilder().ToString());

<span style="color: #66D9EF;">StringReader</span> <span style="color: #F92672;">sr</span> = <span style="color: #66D9EF;">new</span> <span style="color: #66D9EF;">StringReader</span>(@<span style="color: #E6DB74;">"{""Input"":""stone"", ""Output"":""gold""}"</span>);
<span style="color: #66D9EF;">Project</span> <span style="color: #F92672;">p1</span> = (<span style="color: #66D9EF;">Project</span>)serializer.Deserialize(<span style="color: #66D9EF;">new</span> <span style="color: #66D9EF;">JsonTextReader</span>(sr), typeof(Project));
Console.WriteLine(p1.Input + <span style="color: #E6DB74;">"=&gt;"</span> + p1.Output);<span style="color: #E6DB74;">"}"</span>)
</pre>
</div>
</div>
</li></ol>
</div>
</div>
</div>

<div id="outline-container-sec-12" class="outline-2">
<h2 id="sec-12"><span class="section-number-2">12</span> idea</h2>
<div class="outline-text-2" id="text-12">
</div><div id="outline-container-sec-12-1" class="outline-3">
<h3 id="sec-12-1"><span class="section-number-3">12.1</span> <span class="done DONE">DONE</span> mac 下截图工具</h3>
<div class="outline-text-3" id="text-12-1">
<ul class="org-ul">
<li>State "DONE"       from ""           <span class="timestamp-wrapper"><span class="timestamp">[2015-08-27 Thu 17:01]</span></span>
</li>
</ul>
<p>
qq 不错 先用着
</p>
</div>
</div>
</div>
</div>
<div id="postamble" class="status">
<p class="author">Author: U-ALW15\mut</p>
<p class="date">Created: 2016-03-20 Sun 14:56</p>
<p class="creator"><a href="http://www.gnu.org/software/emacs/">Emacs</a> 24.5.1 (<a href="http://orgmode.org">Org</a> mode 8.2.10)</p>
<p class="validation"><a href="http://validator.w3.org/check?uri=referer">Validate</a></p>
</div>
</body>
</html>